# What is pandas
### It is a data analysis library, helps you to get ready for machine learning.
### It is used to explore,organize and manipulate the data

In [7]:
import pandas as pd

# pandas DataTyoes
### SERIES - 1 Dimensional

In [8]:
series_datatype = pd.Series(["BMW","AUDI","MERCEDES","TATA"])
series_datatype

0         BMW
1        AUDI
2    MERCEDES
3        TATA
dtype: object

In [9]:
colour = pd.Series(["RED","BLUE","BLACK","GREY"])
colour

0      RED
1     BLUE
2    BLACK
3     GREY
dtype: object

# DATAFRAME - 2 Dimensional

In [10]:
car_data = pd.DataFrame({"car-type":series_datatype,"color":colour})
car_data

   car-type  color
0       BMW    RED
1      AUDI   BLUE
2  MERCEDES  BLACK
3      TATA   GREY

# IMPORT A FILE

In [13]:
car_sales = pd.read_csv("car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

# EXPORTING DATA

In [14]:
car_sales.to_csv("Exported_car_sales_data.csv",index = False)

# RE-IMPORTING THE EXPORTED DATA

In [16]:
car_sales2 = pd.read_csv("Exported_car_sales_data.csv")
car_sales2

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

# DESCRIBE THE DATA
### ATTRIBUTES

In [18]:
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [20]:
car_columns = car_sales.columns
car_columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [21]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

### FUNCTIONS

In [22]:
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [23]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [25]:
car_sales["Odometer (KM)"].mean()

78601.4

In [26]:
car_sales["Doors"].mean()

4.0

In [27]:
car_sales["Doors"].sum()

40

In [28]:
car_sales["Odometer (KM)"].sum()

786014

# VIEWING AND SELECTING DATA

In [36]:
car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [37]:
car_sales.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

# loc and iloc

### loc - Refers to the index

In [41]:
animals = pd.Series(["Tiger","Lion","Leapord","Cheetah","Cat"],index = [2,3,4,5,3])
animals.loc[3]

3    Lion
3     Cat
dtype: object

In [43]:
animals.iloc[:3]

2      Tiger
3       Lion
4    Leapord
dtype: object

## SELECTING THE DATA

In [44]:
car_sales["Odometer (KM)"]

0    150043
1     87899
2     32549
3     11179
4    213095
5     99213
6     45698
7     54738
8     60000
9     31600
Name: Odometer (KM), dtype: int64

In [45]:
car_sales["Odometer (KM)"]>100000

0     True
1    False
2    False
3    False
4     True
5    False
6    False
7    False
8    False
9    False
Name: Odometer (KM), dtype: bool